#ifndef RCC_H
#define RCC_H

#include "flash.h"
#include "utility.h"
#include <cstdint>

struct Rcc {

    constexpr static uint32_t base = 0x40023800;
    constexpr static uint32_t interrupt = 5;
    constexpr static uint16_t  timeoutValue = 0xffff;

    enum class PllP : uint8_t {
        p2 = 0b00,
        p4 = 0b01,
        p6 = 0b10,
        p8 = 0b11,
    };

    enum class SysClockSrc : uint8_t {
        hsi = 0b00,
        hse = 0b01,
        pll = 0b10,
    };

    enum class ApbPrescaler : uint8_t {
        prescaler1 = 0b000,
        prescaler2 = 0b100,
        prescaler4 = 0b101,
        prescaler8 = 0b110,
        prescaler16 = 0b111,
    };

    constexpr static uint8_t ApbPrescalerToValue[] {1, 1, 1, 1,
        2, 4, 8, 16};

    enum class McoPrescaler : uint8_t {
        prescaler1 = 0b000,
        prescaler2 = 0b100,
        prescaler3 = 0b101,
        prescaler4 = 0b110,
        prescaler5 = 0b111,
    };

    enum class Mco1Src : uint8_t {
        hsi = 0b00,
        lse = 0b01,
        hse = 0b10,
        pll = 0b11,
    };
    enum class Mco2Src : uint8_t {
        sysclk = 0b00,
        pll2s = 0b01,
        hse = 0b10,
        pll = 0b11,
    };

    enum class PllSaiDivr : uint8_t {
        divr2 = 0b000,
        divr4 = 0b01,
        divr8 = 0b10,
        divr16 = 0b11,

    };

    enum class RtcClkSrc : uint8_t {
        no   = 0b00,
        lse  = 0b01,
        lsi  = 0b10,
        hse  = 0b11
    };

    struct Regs {
         uint32_t CR; 	//< 0x0 clock control register
         uint32_t PLLCFGR; 	//< 0x4 PLL configuration register
         uint32_t CFGR; 	//< 0x8 clock configuration register
         uint32_t CIR; 	//< 0xC clock interrupt register
         uint32_t AHB1RSTR; 	//< 0x10 AHB1 peripheral reset register
         uint32_t AHB2RSTR; 	//< 0x14 AHB2 peripheral reset register
         uint32_t AHB3RSTR; 	//< 0x18 AHB3 peripheral reset register
         uint32_t reserved0; 	//< reserved
         uint32_t APB1RSTR; 	//< 0x20 APB1 peripheral reset register
         uint32_t APB2RSTR; 	//< 0x24 APB2 peripheral reset register
         uint32_t reserved1[2]; 	//< reserved
         uint32_t AHB1ENR; 	//< 0x30 AHB1 peripheral clock register
         uint32_t AHB2ENR; 	//< 0x34 AHB2 peripheral clock enable register
         uint32_t AHB3ENR; 	//< 0x38 AHB3 peripheral clock enable register
         uint32_t reserved2; 	//< reserved
         uint32_t APB1ENR; 	//< 0x40 APB1 peripheral clock enable register
         uint32_t APB2ENR; 	//< 0x44 APB2 peripheral clock enable register
         uint32_t reserved3[2]; 	//< reserved
         uint32_t AHB1LPENR; 	//< 0x50 AHB1 peripheral clock enable in low power mode register
         uint32_t AHB2LPENR; 	//< 0x54 AHB2 peripheral clock enable in low power mode register
         uint32_t AHB3LPENR; 	//< 0x58 AHB3 peripheral clock enable in low power mode register
         uint32_t reserved4; 	//< reserved
         uint32_t APB1LPENR; 	//< 0x60 APB1 peripheral clock enable in low power mode register
         uint32_t APB2LPENR; 	//< 0x64 APB2 peripheral clock enabled in low power mode register
         uint32_t reserved5[2]; 	//< reserved
         uint32_t BDCR; 	//< 0x70 Backup domain control register
         uint32_t CSR; 	//< 0x74 clock control & status register
         uint32_t reserved6[2]; 	//< reserved
         uint32_t SSCGR; 	//< 0x80 spread spectrum clock generation register
         uint32_t PLLI2SCFGR; 	//< 0x84 PLLI2S configuration register
         uint32_t PLLSAICFGR; 	//< 0x88 RCC PLL configuration register
         uint32_t DCKCFGR; 	//< 0x8C RCC Dedicated Clock Configuration Register
    };

    struct CR {
        constexpr static uint8_t PLLSAIRDY[]{ 29, 1 }; 	//< PLLI2S clock ready flag
        constexpr static uint8_t PLLSAION[]{ 28, 1 }; 	//< PLLI2S clock ready flag
        constexpr static uint8_t PLLI2SRDY[]{ 27, 1 }; 	//< PLLI2S clock ready flag
        constexpr static uint8_t PLLI2SON[]{ 26, 1 }; 	//< PLLI2S enable
        constexpr static uint8_t PLLRDY[]{ 25, 1 }; 	//< Main PLL (PLL) clock ready flag
        constexpr static uint8_t PLLON[]{ 24, 1 }; 	//< Main PLL (PLL) enable
        constexpr static uint8_t CSSON[]{ 19, 1 }; 	//< Clock security system enable
        constexpr static uint8_t HSEBYP[]{ 18, 1 }; 	//< HSE clock bypass
        constexpr static uint8_t HSERDY[]{ 17, 1 }; 	//< HSE clock ready flag
        constexpr static uint8_t HSEON[]{ 16, 1 }; 	//< HSE clock enable
        constexpr static uint8_t HSICAL[]{ 8, 8 }; 	//< Internal high-speed clock calibration
